Revit 2027 API
EmbodiedCarbonAsset Methods
The EmbodiedCarbonAsset type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EqualsEmbodiedCarbonOnly |  Determines whether this embodied carbon asset is equal to another, but ignore data from base class.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
EmbodiedCarbonAsset Class
Autodesk.Revit.DB Namespace